app/controllers/trans_dots_controller.rb

SELECT "trans_dots".* FROM "trans_dots" LIMIT 15 OFFSET 0
---
  def index
    @trans_dots = TransDot.paginate(:page => params[:page], :per_page=>15)  #TransDot.all